tutorials/buoyantBoussinesqPiso4PCMFoam/PCMwithAPI/case/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    right
    {
        type                    timeVaryingRobin4PCMFoam;
        Kappa                   kappaEff;
        qo
        {
            fileName        "$FOAM_CASE/constant/tables/qovsTime";
            outOfBounds     clamp;           // (error|warn|clamp|repeat)
        }
        ho
        {
            fileName        "$FOAM_CASE/constant/tables/hovsTime";
            outOfBounds     clamp;
        }
        To
        {
            fileName        "$FOAM_CASE/constant/tables/TovsTime";
            outOfBounds     clamp;
        }
    }

    ".*"
    {
	type		zeroGradient;
    }
}

// ************************************************************************* //
