tutorials/buoyantBoussinesqPiso4PCMFoam/PCMwithAPI/case/constant/PCMProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      PCMProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

hm		hm [0 2 -2 0 0 0 0]	187210.0;
Tm		Tm [0 0 0 1 0 0 0]	319.0;
Tmr		Tmr [0 0 0 1 0 0 0]	4.7;
Cu		Cu [1 -3 -1 0 0 0 0]	1.0e5;
b		b [0 0 0 0 0 0 0]	1.0e-3;

// ************************************************************************* //
