tutorials/buoyantBoussinesqPiso4PCMFoam/PCMwithAPI/case/constant/tables/TempvsTime
(
    (0 300)
    (4800 343)
)
