tutorials/buoyantBoussinesqPiso4PCMFoam/PCMwithAPI/case/constant/tables/qovsTime
(
    (0 300)
    (4800 500)
)
