tutorials/buoyantBoussinesqPiso4PCMFoam/PCMwithAPI/case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
    "liblduSolvers.so"
    "libPCM4Foam.so"
)

application     buoyantBoussinesqPiso4PCMFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         4800;

deltaT          0.1;

writeControl    adjustableRunTime;

writeInterval   600;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.7;

maxDeltaT       10.0;

InfoSwitches
{
    writePrecision  6;
    writeJobInfo    0;
    allowSystemOperations 1;
}

functions
(
    postProcess
    {
        functionObjectLibs    ("libutilityFunctionObjects.so");
        type                  coded;
        name                  postProcess;
        enabled               true;
        outputControl         outputTime;
        redirectType          postProcess;

        code
        #{
            std::ofstream output;
            output.open("postProcess.txt",std::ofstream::app);


            //- lookup fields
            const volVectorField& U = mesh().lookupObject<volVectorField>("U");
            const volScalarField& gamma = mesh().lookupObject<volScalarField>("gamma");
            const fvMesh& mesh = U.mesh();
            const scalarField& volumeCell = mesh.V();
            scalar meltingFraction = (fvc::domainIntegrate(gamma).value()/sum(volumeCell))*100;

            scalar t_ = U.mesh().time().value();
            scalar deltaT_ = U.mesh().time().deltaT().value();

            output << "Time: " << t_ << "\t" << "meltingFraction: " << meltingFraction << "%" << "\n";
            output.close();
        #};
    }
);
// ************************************************************************* //
